---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarBendRadiusTooBigWarn
source: html/7b46140c-322f-c8fd-195b-de213c18a815.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarBendRadiusTooBigWarn Property

Rebar Bend Radius is too big. Ignoring bend.

## Syntax (C#)
```csharp
public static FailureDefinitionId RebarBendRadiusTooBigWarn { get; }
```